tests/e2e/artillery/web-scenarios.yml
---
config:
  target: ${TARGET_URL:-http://localhost}
  plugins:
    expect:
      reportFailuresAsErrors: true
      outputFormat: prettyError
    expectDefault200: true
  tls:
    rejectUnauthorized: false
  # Enable the Playwright engine:
  environments:
    production:
      target: "https://worldinmovies.duckdns.org"
      phases:
        - duration: 1200
          arrivalRate: 10
    local:
      target: "http://localhost"
      phases:
        - duration: 60
          arrivalRate: 20
  phases:
    - name: 'Breaking test'
      duration: 60
      rampTo: 5
  engines:
    playwright:
      aggregateByName: true
    processor: "./playwright-flows.spec.ts"
  scenarios:
    - name: Web Scenario
      engine: playwright
      flowFunction: "scenario"
      flow:
        - log: "Current environment is {{ $environment }}"